tap "buildkite/buildkite"
tap "dbt-labs/dbt-cli"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mike-engel/jwt-cli"
tap "pulumi/tap"
tap "tilt-dev/tap"
# Library for manipulating PNG images
brew "libpng"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Message bus system, providing inter-application communication
brew "dbus"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# OpenType text shaping engine
brew "harfbuzz"
# Google's own build tool
brew "bazel"
# Utility to examine and validate certificates in a variety of formats
brew "certigo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Utility for connecting securely to your Cloud SQL instances
brew "cloud-sql-proxy"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# CLI helps develop/deploy/debug apps with Docker and k8s
brew "devspace"
# Measure DNS performance by simulating network conditions
brew "dnsperf"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Geometry Engine
brew "geos"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Generic library support script
brew "libtool"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Like cURL, but for gRPC
brew "grpcurl"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# C/C++ seam carving library
brew "liblqr"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Rainbows and unicorns in your console!
brew "lolcat"
# Menu-driven communications program
brew "minicom"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Modern shell for the GitHub era
brew "nushell"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Cross-platform library for audio I/O
brew "portaudio"
# Convert PostScript and PDF files to editable vector graphics
brew "pstoedit"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Non-interactive SSH password auth
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Generate scripting interfaces to C/C++ code
brew "swig"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# A command-line tool for working with Buildkite
brew "buildkite/buildkite/bk@2"
# Build runner for use with Buildkite
brew "buildkite/buildkite/buildkite-agent"
# dbt Labs' CLI.
brew "dbt-labs/dbt-cli/dbt"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Vault
brew "hashicorp/tap/vault"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Making local Kubernetes clusters easy to set up and tear down
brew "tilt-dev/tap/ctlptl"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
vscode "bierner.markdown-mermaid"
vscode "dannymidnight.vscode-buildkite"
vscode "davidanson.vscode-markdownlint"
vscode "editorconfig.editorconfig"
vscode "geforcelegend.vscode-glsl"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "innoverio.vscode-dbt-power-user"
vscode "janisdd.vscode-edit-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "peterj.proto"
vscode "platformio.platformio-ide"
vscode "pulumi.pulumi-lsp-client"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "stackbuild.bazel-stack-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "wholroyd.jinja"
vscode "zainchen.json"
