# Tools that are configured in this repository
brew "fish"
brew "git"
brew "git-lfs"
brew "mise"
brew "neofetch"

# Commonly used utilities
brew "autoconf"
brew "automake"
brew "cowsay"
brew "fortune"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "lolcat"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"

# Kubernetes
brew "devspace"
brew "kubectx"
tap "derailed/k9s"
brew "derailed/k9s/k9s"

# Applications
cask "firefox"
cask "iterm2"
cask "rectangle"
cask "visual-studio-code"

## VS Code extensions

vscode "editorconfig.editorconfig"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
# Even Better TOML
vscode "tamasfe.even-better-toml"